#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.selected[0]: Reading...
data.aws_vpc.selected[0]: Read complete after 0s [id=vpc-04adbc006871eed44]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = "vpc-04adbc006871eed44"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hello_kaotik = "Hello, KaotiK!"
  + vpc_id       = "vpc-04adbc006871eed44"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>